---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalustersPerTread
source: html/92f87a1f-ead5-49e5-06f3-5cb7f4e2be0e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalustersPerTread Property

"Balusters Per Tread (Stair Railing Only)"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingBalustersPerTread { get; }
```